{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_19", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": true, "batch_input_shape": [1, 1, 100], "W_regularizer": null, "output_dim": 300, "forget_bias_init": "one", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_31"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_20", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": true, "batch_input_shape": [1, 1, 300], "W_regularizer": null, "output_dim": 150, "forget_bias_init": "one", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_32"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_21", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": false, "batch_input_shape": [1, 1, 150], "W_regularizer": null, "output_dim": 75, "forget_bias_init": "one", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_33"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_19", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 75}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_34"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_20", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_35"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_21", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 15}}]}