{"loss": "categorical_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_6", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": false, "batch_input_shape": [1, 1, 100], "W_regularizer": null, "output_dim": 400, "forget_bias_init": "one", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_10"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_11"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_12"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 5}}], "sample_weight_mode": null}