{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 100], "trainable": true, "name": "dropout_24", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 300}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_25"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_25", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 300}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_26"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_26", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 80}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_27"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_27", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 80}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_28"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_28", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_29"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_29", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_30"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_30", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 5}}]}