{"loss": "categorical_crossentropy", "optimizer": {"nesterov": false, "lr": 0.10000000149011612, "name": "SGD", "momentum": 0.800000011920929, "decay": 9.999999747378752e-05}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 1000], "trainable": true, "name": "dropout_22", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_22", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 300}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_23"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_23", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 300}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_24"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 80}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_25"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_25", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 80}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_26"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_26", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_27"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_27", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_28"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_28", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 5}}], "sample_weight_mode": null}